package application;

public class temp {
	
	public static void main(String[] arg)
	{
		String aa="Ā ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ćĀ ā Ă ă Ą ą Ć ć";
		System.out.println(aa.toCharArray());
		
	}
	
	public static String convertor(String aa)
	{
	    StringBuilder b = new StringBuilder();

	    for (char c : aa.toCharArray()) {
	        if (c >= 128)
	            b.append("\\u").append(String.format("%04X", (int) c));
	        else
	            b.append(c);
	    }
	    return b.toString();
	}

}
